repeat = "Y"
while repeat == "y" or repeat == "Y":
  print("อ่านข้อความต่อไปนี้เพื่อสังเกตอาการ และ แยกโรคขแงตนเอง")
  print("""อาการ ภูมิแพ้
  -จาม
  -น้ำตาไหล
  -คันตา
  -คัน/คัดจมูก
  -อาจมีน้ำมูกไหล
  -เกิดผื่นแพ้ต่าง ๆ ได้""")
  print("""อาการ โรคไข้หวัด
  -คัดจมูก
  -น้ำมูกไหลลักษณะใส
  -ไอมีเสหะ
  -จาม
  -เจ็บคอ
  -เสียงแหบ
  -อาจมีไข้ต่ำ ๆ ปวดศีรษะเล็กน้อย""")
  print("""อาการ โรคไข้หวัดใหญ่
  -คัดจมูก
  -น้ำมูกไหลลักษณะใส
  -ไอมีเสหะ
  -จาม
  -เจ็บคอ
  -เสียงแหบ
  -อาจมีไข้ต่ำ ๆ ปวดศีรษะเล็กน้อย""")
  print("""อาการ โควิด-19
  -มีไข้
  -รู้สึกเมื่อยล้า
  -ไอแห้ง ๆ
  -หายใจได้ลำบาก
  -บางครั้งอาจมีอาการเจ็บคอ""")

  covid_check = input("จากข้อมูลอาการข้างต้น ผู้ใช้งานคิดว่าตนเองติด โควิด-19 หรือไม่? (Y/N) : ")
  if covid_check == "Y" or covid_check == "y":
    covid_tel = input("ผู้ใช้งานต้องการเบอร์โทรศัพท์สำหรับหาเตียงผู้ป้วย หรือ เพจช่วยเหลือดูแลผู้ป่วย โควิด-19 หรือไม่? (Y/N) : ")
    if covid_tel == "Y" or covid_tel == "y":
      print("""เบอร์โทรศัพท์
  -1669(สถาบันการแพทย์ฉุกเฉินแห่งชาติ) หรือ แอดไลน์ไอดี @sabaideebot
  -1330(สอบถามข้อมูลสิทธิประกันสุขภาพแห่งชาติ)
  -1668(กด1) กรมการแพทย์ สายด่วนเฉพาะกิจเฉพาะในเขตกรุงเทพฯ และปริมณฑล 
  -1422(กรมควบคุมโรค) หรือสอบถามข้อมูล ความรู้ด้านสุขภาพ และข้อสงสัยสำหรับผู้ป่วยติดเชื้อ
  -1506(ประกันสังคม) หรือสอบถาม สิทธิประโยชน์ประกันสังคมการรักษาพยาบาล""")
      print("""เพจช่วยเหลือดูแลผู้ป่วยโควิด
  -มูลนิธิกระจกเงา รับบริจาคและส่งมอบสิ่งของช่วยเหลือผู้ป่วยโควิด โทร. 094-878-664
  -เพจเราต้องรอด ช่วยประสานงานหาเตียง และรถพยาบาลรับส่งผู้ป่วยต้องลงทะเบียนตามขั้นตอนต่างๆ 
  -เพจเส้นด้าย-Zendai ช่วยประสานงานหาเตียง และรถพยาบาลรับส่งผู้ป่วย โทร. 081-591-9714 / 080-660-9998
  -หมอแล็บแพนด้า ช่วยประสานหาเตียงติดต่อเฟซบุ๊ก 
  -Drama-Addict ช่วยประสานหาเตียง ติดต่อเฟซบุ๊ก """)
    
    vaccine_advise = input("ผู้ใช้งานต้องการข้อมูลเกี่ยวกับวัคซีน โควิด-19 หรือไม่? (Y/N) : ")
    if vaccine_advise == "Y" or vaccine_advise =="y":
      user_age = int(input("กรอกอายุของผู้ใช้งาน : "))
      if user_age >= 18:
        print("""
  -วัคซีน Moderna ประสิทธิภาพในการป้องกัน 94.1%
  -วัคซีน Sinovac ประสิทธิภาพในการป้องกัน 49.6-50.7%
  -วัคซีน Sinopharm/BBIBP-CorV  ประสิทธิภาพในการป้องกัน 79.3%
  -วัคซีน AstraZeneca ประสิทธิภาพในการป้องกัน 70.4-82.4%
  -วัคซีน Pfizer/BioNtech ประสิทธิภาพในการป้องกัน 81.8-95%
  -วัคซีน Johnson & Johnson ประสิทธิภาพในการป้องกัน มากกว่า 65%
  -วัคซีน Sputnik V ประสิทธิภาพในการป้องกัน มากกว่า 91%
  -วัคซีน Novavax ประสิทธิภาพในการป้องกัน มากกว่า 89%
    """)
      elif user_age >= 12:
        print("-วัคซีน Pfizer/BioNtech ประสิทธิภาพในการป้องกัน 81.8-95%")
      
      else:
        print("ผู้ที่มีอายุไม่ถึง 12 ปี ไม่สามารถรับวัคซีน โควิด-19 ได้")
      
  elif covid_check == "N" or covid_check =="n":
    print("""   หากไม่ติด โควิด-19 ก็อาจเสี่ยงต่อการติดโรคอื่นๆได้ วิธีการป้องกันโรคที่ดีที่สุดของทั้งภูมิแพ้ 
ไข้หวัด ไข้หวัดใหญ่ คือ การล้างมือบ่อย ๆ ไม่เอามือไปสัมผัสหน้าตา หลีกเลี่ยงการสัมผัสใกล้ชิดกับผู้ป่วย 
หลีกเลี่ยงพื้นที่ที่มีคนแออัด ในช่วงที่มีการระบาด เว้นระยะห่าง (Social Distancing) ใส่หน้ากากผ้าหรือหน้ากากอนามัย 
ในผู้สูงอายุละเด็ก ควรได้รับการฉีดวัคซีนป้องกันไข้หวัดใหญ่ปีละ 1 ครั้ง เพื่อให้ห่างไกลโรค""")

  repeat = input("Repeat ? (Y/N) : ")
        
