
#ดูว่าผู้ใช้มีข้อมูลเกรดของเทอมไหนบ้าง
present_grade = int(input("ตอนนี้ผู้ใช้งานมีเกรดทั้งหมดกี้ภาคเรียน : "))
print(''': มีเกรด 1 เทอม''')
print("ผู้ใช้งานมีเกรดของเทอมไหนแล้วบ้าง")


'''
grade_goal5 = int(input("กรอกเป้าหมาย GPAX 5 เทอม (Ex. 2.25,3.50) : "))
grade_goal6 = int(input("กรอกเป้าหมาย GPAX 6 เทอม (Ex. 2.25,3.50) : "))
'''

class Science(): #class แม่ สำหรับคิด GPAX วิทย์ (กลุ่มสาระการเรียนรู้พื้นฐาน และ เพิ่มเติม)
    def basic_subject():
        print("กลุ่มสาระการเรียนรู้พื้นฐาน")
        thai = (input(""))



print('''
โปรแกรมนี้เป็นโปรแกรมที่จะนำข้อมูลเกรดของคุณไปคำนวณหา 
-GPAX 5,6 ภาคเรียน 
-คำนวณ GPA ตามกลุ่มสาระ
-คำนวณหาเกรดเฉลี่ยขั้นต่ำเพื่อบรรลุเป้าหมายเกรดที่ต้องการเมื่อจบการศึกษา
''')
print('''1 : สายการเรียน วิทยาศาสตร์-ทั่วไป")
2 : สายการเรียน วิทยาศาสตร์-สุขภาพ
3 : สายการเรียน วิทยาศาสตร์-วิศวะ
4 : สายการเรียน วิทยาศาสตร์-อินเตอร์
5 : สายการเรียน ศิลป์-จีน
6 : สายการเรียน ศิลป์-ญี่ปุ่น
7 : สายการเรียน ศิลป์-เยอรมัน
8 : สายการเรียน ศิลป์-การแสดง
9 : สายการเรียน ศิลป์-สังคม
''')

learning_path = input("พิมพ์ตัวเลข(1-9) เพื่อเลือกสายการเรียนของคุณ : ")



if learning_path == 1:
    print("ใส่เกรดเฉลี่ยที่คุณทำได้ หากเทอมไหน")
    

